## Plan Result (1112: stg_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 7 to change, 15 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.rbac_account[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-xcutting&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_container.landing[&#34;00-html-template&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-rsp-checkpoint&#34;]
  * local_file.config[&#34;00&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
* Delete
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-td&#34;]
  * azurerm_role_assignment.rbac_account[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-zcutting&#34;]
  * azurerm_storage_account.zcutting[&#34;00&#34;]
  * azurerm_storage_container.zcutting[&#34;00-db-ack-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;00-db-rsp-checkpoint&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/7cdf450e-be3d-4983-9f14-41341873b34e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "7cdf450e-be3d-4983-9f14-41341873b34e" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/03b5ebec-9ab2-4d2f-9267-42a8d82a2a39" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "03b5ebec-9ab2-4d2f-9267-42a8d82a2a39" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-apluta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/b7409287-ddf4-4534-8cea-042d41833484" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "b7409287-ddf4-4534-8cea-042d41833484" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-bails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/901a2ae7-340e-4c08-b5e2-63d25befd4db" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "901a2ae7-340e-4c08-b5e2-63d25befd4db" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-joh"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/4b3baaad-78e3-4245-a765-a540ed221f72" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "4b3baaad-78e3-4245-a765-a540ed221f72" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-sbails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/e12676a3-223f-4612-a302-34809581ed6a" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "e12676a3-223f-4612-a302-34809581ed6a" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-td"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/objectId/9fbfabf1-6601-41b0-bf8f-ba3066f8a8db" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - object_id               = "9fbfabf1-6601-41b0-bf8f-ba3066f8a8db" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfpa-stg00-uks-dlrm-01"
        name                                           = "af-aplfpa-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfta-stg00-uks-dlrm-01"
        name                                           = "af-aplfta-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-apluta-stg00-uks-dlrm-01"
        name                                           = "af-apluta-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-bails-stg00-uks-dlrm-01"
        name                                           = "af-bails-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-joh-stg00-uks-dlrm-01"
        name                                           = "af-joh-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-sbails-stg00-uks-dlrm-01"
        name                                           = "af-sbails-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "stg"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> (known after apply)
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-td-stg00-uks-dlrm-01"
        name                                           = "af-td-stg00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00zcuttingstg" -> "ingest00xcuttingstg"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.rbac_account["00-xcutting"] will be created
  + resource "azurerm_role_assignment" "rbac_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "836e393f-0153-4c8f-8f40-705f944fdf51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_account["00-zcutting"] will be destroyed
  # (because key ["00-zcutting"] is not in for_each map)
  - resource "azurerm_role_assignment" "rbac_account" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/providers/Microsoft.Authorization/roleAssignments/027a70e0-1b9a-b712-5067-dc19b4b07781" -> null
      - name                                   = "027a70e0-1b9a-b712-5067-dc19b4b07781" -> null
      - principal_id                           = "836e393f-0153-4c8f-8f40-705f944fdf51" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> null
      - role_definition_name                   = "Storage Account Contributor" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.rbac_owner["00-xcutting"] will be created
  + resource "azurerm_role_assignment" "rbac_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "836e393f-0153-4c8f-8f40-705f944fdf51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_owner["00-zcutting"] will be destroyed
  # (because key ["00-zcutting"] is not in for_each map)
  - resource "azurerm_role_assignment" "rbac_owner" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/providers/Microsoft.Authorization/roleAssignments/cc04da34-92e3-d187-ffe8-0fbec47af2cb" -> null
      - name                                   = "cc04da34-92e3-d187-ffe8-0fbec47af2cb" -> null
      - principal_id                           = "836e393f-0153-4c8f-8f40-705f944fdf51" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1" -> null
      - role_definition_name                   = "Storage Blob Data Reader" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.rbac_queue["00-xcutting"] will be created
  + resource "azurerm_role_assignment" "rbac_queue" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "836e393f-0153-4c8f-8f40-705f944fdf51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_queue["00-zcutting"] will be destroyed
  # (because key ["00-zcutting"] is not in for_each map)
  - resource "azurerm_role_assignment" "rbac_queue" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/providers/Microsoft.Authorization/roleAssignments/eb5fa1ea-e48d-1f15-8ea9-521722c9ae79" -> null
      - name                                   = "eb5fa1ea-e48d-1f15-8ea9-521722c9ae79" -> null
      - principal_id                           = "836e393f-0153-4c8f-8f40-705f944fdf51" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.rbac_table["00-xcutting"] will be created
  + resource "azurerm_role_assignment" "rbac_table" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "836e393f-0153-4c8f-8f40-705f944fdf51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_table["00-zcutting"] will be destroyed
  # (because key ["00-zcutting"] is not in for_each map)
  - resource "azurerm_role_assignment" "rbac_table" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/providers/Microsoft.Authorization/roleAssignments/68e3a4a6-3f67-8dbd-88a1-1553f69c35f4" -> null
      - name                                   = "68e3a4a6-3f67-8dbd-88a1-1553f69c35f4" -> null
      - principal_id                           = "836e393f-0153-4c8f-8f40-705f944fdf51" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.rbac_write["00-xcutting"] will be created
  + resource "azurerm_role_assignment" "rbac_write" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "836e393f-0153-4c8f-8f40-705f944fdf51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_write["00-zcutting"] will be destroyed
  # (because key ["00-zcutting"] is not in for_each map)
  - resource "azurerm_role_assignment" "rbac_write" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/providers/Microsoft.Authorization/roleAssignments/36da5ffe-3970-1f13-9a80-ab85bc8e0864" -> null
      - name                                   = "36da5ffe-3970-1f13-9a80-ab85bc8e0864" -> null
      - principal_id                           = "836e393f-0153-4c8f-8f40-705f944fdf51" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be created
  + resource "azurerm_storage_account" "xcutting" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ingest00xcuttingstg"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ingest00-main-stg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_account.zcutting["00"] will be destroyed
  # (because azurerm_storage_account.zcutting is not in configuration)
  - resource "azurerm_storage_account" "zcutting" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "ingest00zcuttingstg" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://ingest00zcuttingstg.blob.core.windows.net/" -> null
      - primary_blob_host                  = "ingest00zcuttingstg.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://ingest00zcuttingstg.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "ingest00zcuttingstg.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://ingest00zcuttingstg.file.core.windows.net/" -> null
      - primary_file_host                  = "ingest00zcuttingstg.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://ingest00zcuttingstg.queue.core.windows.net/" -> null
      - primary_queue_host                 = "ingest00zcuttingstg.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://ingest00zcuttingstg.table.core.windows.net/" -> null
      - primary_table_host                 = "ingest00zcuttingstg.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://ingest00zcuttingstg.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "ingest00zcuttingstg.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest00-main-stg" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "staging"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_container.landing["00-html-template"] will be created
  + resource "azurerm_storage_container" "landing" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "html-template"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00landingstg"
    }

  # azurerm_storage_container.xcutting["00-db-ack-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-ack-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingstg"
    }

  # azurerm_storage_container.xcutting["00-db-rsp-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-rsp-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingstg"
    }

  # azurerm_storage_container.zcutting["00-db-ack-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest00zcuttingstg.blob.core.windows.net/db-ack-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-ack-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/blobServices/default/containers/db-ack-checkpoint" -> null
      - storage_account_name              = "ingest00zcuttingstg" -> null
    }

  # azurerm_storage_container.zcutting["00-db-rsp-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest00zcuttingstg.blob.core.windows.net/db-rsp-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-rsp-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingstg/blobServices/default/containers/db-rsp-checkpoint" -> null
      - storage_account_name              = "ingest00zcuttingstg" -> null
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_00.json"
      + id                   = (known after apply)
    }

Plan: 10 to add, 7 to change, 15 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Target":"1112: stg_aria - Terraform Plan Apply","Vars":{}} -->